block_name_list = ['Название события 1 X 2 1X 12 X2 Фора1 Фора2 Меньше Больше\n1.\nКатар\n20 ноя 19:00\n2.\nЭквадор\n0% маржа\n\n+402\n3.84 3.42 2.23 1.79 1.40 1.34 (0)\n2.71 (0)\n1.58 (2.5)\n1.666 (2.5)\n2.49\n1.\nАнглия\n21 ноя 16:00\n2.\nИран\n+378\n1.32 5.10 12.25 1.049 1.192 3.62 (-1.5)\n2.03 (+1.5)\n1.86 (2.5)\n1.78 (2.5)\n2.10\n1.\nСенегал\n21 ноя 19:00\n2.\nНидерланды\n+399\n6.45 3.92 1.60 2.44 1.285 1.137 (+1.0)\n1.85 (-1.0)\n2.04 (2.5)\n1.78 (2.5)\n2.10\n1.\nСША\n21 ноя 22:00\n2.\nУэльс\n+396\n2.64 3.08 3.02 1.43 1.41 1.53 (0)\n1.83 (0)\n2.07 (2.5)\n1.56 (2.5)\n2.52\n1.\nАргентина\n22 ноя 13:00\n2.\nСаудовская Аравия\n+379\n1.162 7.90 20.50 1.014 1.101 5.75 (-2.0)\n1.87 (+2.0)\n2.02 (2.5)\n2.40 (2.5)\n1.61\n1.\nДания\n22 ноя 16:00\n2.\nТунис\n+392\n1.47 4.40 7.80 1.103 1.24 2.82 (-1.0)\n1.79 (+1.0)\n2.12 (2.5)\n1.78 (2.5)\n2.10\n1.\nМексика\n22 ноя 19:00\n2.\nПольша\n+398\n2.76 3.20 2.78 1.49 1.39 1.49 (0)\n1.94 (0)\n1.95 (2.5)\n1.57 (2.5)\n2.50\n1.\nФранция\n22 ноя 22:00\n2.\nАвстралия\n+392\n1.24 6.40 13.75 1.04 1.138 4.40 (-1.5)\n1.74 (+1.5)\n2.20 (2.5)\n2.30 (2.5)\n1.66\n1.\nМарокко\n23 ноя 13:00\n2.\nХорватия\n+394\n4.85 3.30 1.90 1.97 1.37 1.21 (+1.0)\n1.48 (-1.0)\n2.82 (2.5)\n1.60 (2.5)\n2.42\n1.\nГермания\n23 ноя 16:00\n2.\nЯпония\n+406\n1.44 4.85 7.40 1.112 1.21 2.94 (-1.5)\n2.22 (+1.5)\n1.727 (2.5)\n2.23 (2.5)\n1.70\n1.\nИспания\n23 ноя 19:00\n2.\nКоста-Рика\n+377\n1.21 6.65 17.00 1.025 1.131 4.80 (-2.0)\n2.17 (+2.0)\n1.76 (2.5)\n2.08 (2.5)\n1.80\n1.\nБельгия\n23 ноя 22:00\n2.\nКанада\n+399\n1.37 5.15 9.00 1.083 1.19 3.28 (-1.5)\n2.08 (+1.5)\n1.82 (2.5)\n2.15 (2.5)\n1.75\n1.\nШвейцария\n24 ноя 13:00\n2.\nКамерун\n+383\n1.77 3.54 5.30 1.182 1.33 2.13 (-1.0)\n2.49 (+1.0)\n1.59 (2.5)\n1.57 (2.5)\n2.50\n1.\nУругвай\n24 ноя 16:00\n2.\nРеспублика Корея\n+396\n1.83 3.54 4.85 1.21 1.33 2.05 (-1.0)\n2.65 (+1.0)\n1.533 (2.5)\n1.615 (2.5)\n2.39\n1.\nПортугалия\n24 ноя 19:00\n2.\nГана\n+389\n1.42 4.55 9.00 1.083 1.23 3.04 (-1.0)\n1.69 (+1.0)\n2.28 (2.5)\n1.77 (2.5)\n2.12\n1.\nБразилия\n24 ноя 22:00\n2.\nСербия\n+404\n1.48 4.55 7.20 1.116 1.23 2.79 (-1.0)\n1.79 (+1.0)\n2.12 (2.5)\n2.01 (2.5)\n1.85\n1.\nУэльс\n25 ноя 13:00\n2.\nИран\n+400\n2.26 3.08 3.72 1.31 1.41 1.69 (0)\n1.56 (0)\n2.57 (2.5)\n1.57 (2.5)\n2.50\n1.\nКатар\n25 ноя 16:00\n2.\nСенегал\n+405\n3.78 3.16 2.20 1.727 1.40 1.30 (0)\n2.65 (0)\n1.533 (2.5)\n1.64 (2.5)\n2.34\n1.\nНидерланды\n25 ноя 19:00\n2.\nЭквадор\n+411\n1.66 4.00 5.45 1.175 1.28 2.32 (-1.0)\n2.17 (+1.0)\n1.76 (2.5)\n2.03 (2.5)\n1.833\n1.\nАнглия\n25 ноя 22:00\n2.\nСША\n+405\n1.69 3.90 5.35 1.18 1.285 2.26 (-1.0)\n2.23 (+1.0)\n1.72 (2.5)\n1.83 (2.5)\n2.04\n1.\nТунис\n26 ноя 13:00\n2.\nАвстралия\n+396\n2.875 3.08 2.76 1.49 1.41 1.46 (0)\n1.99 (0)\n1.90 (2.5)\n1.54 (2.5)\n2.58\n1.\nПольша\n26 ноя 16:00\n2.\nСаудовская Аравия\n+405\n1.65 3.98 5.60 1.168 1.28 2.34 (-1.0)\n2.15 (+1.0)\n1.77 (2.5)\n1.84 (2.5)\n2.03\n1.\nФранция\n26 ноя 19:00\n2.\nДания\n+406\n2.05 3.38 3.96 1.28 1.36 1.83 (-1.0)\n3.16 (+1.0)\n1.40 (2.5)\n1.70 (2.5)\n2.23\n1.\nАргентина\n26 ноя 22:00\n2.\nМексика\n+396\n1.60 3.98 6.25 1.143 1.28 2.44 (-1.0)\n2.11 (+1.0)\n1.80 (2.5)\n1.77 (2.5)\n2.12\n1.\nЯпония\n27 ноя 13:00\n2.\nКоста-Рика\n+395\n1.88 3.36 4.85 1.21 1.36 1.99 (-1.0)\n2.78 (+1.0)\n1.49 (2.5)\n1.63 (2.5)\n2.36\n1.\nБельгия\n27 ноя 16:00\n2.\nМарокко\n+402\n1.53 4.25 6.80 1.127 1.26 2.625 (-1.0)\n1.94 (+1.0)\n1.95 (2.5)\n1.94 (2.5)\n1.92\n1.\nХорватия\n27 ноя 19:00\n2.\nКанада\n+406\n1.82 3.80 4.50 1.24 1.30 2.06 (-1.0)\n2.54 (+1.0)\n1.57 (2.5)\n1.81 (2.5)\n2.06\n1.\nИспания\n27 ноя 22:00\n2.\nГермания\n+424\n2.55 3.44 2.84 1.47 1.35 1.56 (0)\n1.85 (0)\n2.04 (2.5)\n1.93 (2.5)\n1.93\n1.\nКамерун\n28 ноя 13:00\n2.\nСербия\n+394\n4.85 3.44 1.86 2.02 1.35 1.21 (+1.0)\n1.50 (-1.0)\n2.75 (2.5)\n1.615 (2.5)\n2.39\n1.\nРеспублика Корея\n28 ноя 16:00\n2.\nГана\n+397\n2.68 2.99 3.05 1.42 1.43 1.52 (0)\n1.82 (0)\n2.08 (2.5)\n1.54 (2.5)\n2.58\n1.\nБразилия\n28 ноя 19:00\n2.\nШвейцария\n+402\n1.51 4.25 7.30 1.114 1.26 2.69 (-1.0)\n1.89 (+1.0)\n2.00 (2.5)\n1.93 (2.5)\n1.93\n1.\nПортугалия\n28 ноя 22:00\n2.\nУругвай\n+410\n2.10 3.48 3.68 1.32 1.34 1.79 (0)\n1.53 (0)\n2.66 (2.5)\n1.72 (2.5)\n2.19']

def split_list(list):
    result = []
    for count, value in enumerate(list):
        splitted = value.split('\\n')
        splitted = value.split('\n')
        print(f'splitted:\n{splitted}')        
        separator = ':'        
        how_many_games = [x for x in splitted if separator in x]
        print(f'\n\nhow_many_games: {how_many_games}')
        print(f'\n\nlen(how_many_games): {len(how_many_games)}')
        start_search = 0 
        print(f'len(splitted): {len(splitted)}')        
        """
        for x in range(len(how_many_games)):
            current_position = splitted.index(how_many_games[x], start_search)
            # print(f'\nx: {x}')
            # print(f'how_many_games[x]: {how_many_games[x]}')
            # print(f'start_search: {start_search}')
            # print(f'current_position: {current_position}')            
           
            result.append(['BetCity',\
                            'World cup 2022',\
                            splitted[current_position - 1],\
                            splitted[current_position],\
                            splitted[current_position + 1],\
                            splitted[current_position + 2],\
                            splitted[current_position + 4],\
                            splitted[current_position + 5],\
                            splitted[current_position + 6]
                            ])
           
            start_search = current_position + 1        
        """
    # print(f'\nresult:\n {result}')
    return result
    
split_list(block_name_list)